import { useState } from "react";
import { Icon } from "../../shared/components/Icon";

import s from "./fifthPart.module.scss";

const data = [
  {
    title: "У США продається один мотлох, навіщо там купувати машину?",
    description:
      "Ринок США дуже багатий на авто будь-якого класу та стану. Щодня з аукціону продається приблизно 2000 автомобілів різних марок та комплектацій. Там є ті, що не підлягають відновленню, так і ті, що мають незначні пошкодження. \nНаше завдання – знайти для вас найкраще з того, що можна вибрати на страховому аукціоні. Всі варіанти погоджуються з клієнтом.",
  },
  {
    title: "Чи може фактична ціна відрізнятися від розрахункової?",
    description:
      "Різниця кінцевої вартості авто без ремонту не перевищує 100$ від розрахункової.",
  },
  {
    title: "Як довго чекати на авто з США?",
    description:
      "<b>Доставка авто ділиться на кілька етапів:</b><ul><li>Доставка від площадки аукціону на склад в США, в середньому до 7 днів;</li><li>Доставка контейнера в порт 5-14 днів</li><li>Доставка морем, від місяця до 2х;</li><li>Розвантаження та доставка авто з Клайпеди до Львова 7-10 робочих днів;</li><li>Розмитнення авто 1 день.</li></ul>",
  },
  {
    title: "Де робити ремонт машини?",
    description:
      "<b>Ремонт можливий на нашому СТО.</b>\nТакож ми можемо доставити авто клієнту без ремонту на будь яке СТО для самостійного ремонту.",
  },
  {
    title: "Чому з Америки машини дешевші?",
    description:
      "У США дуже розвинена страхова система і дорогий ринок праці. Легка несправність або ДТП автомобіля може коштувати більше вартості цілого аналога, тому в США страховій компанії легше виставити автомобіль на аукціон, ніж ремонтувати його.",
  },
  {
    title: "Які гарантії?",
    description:
      "Можливе підписання із замовником договору про надання послуг. Всі платежі за авто та транспортування ви робите безпосередньо на аукціон або на компанію перевізника.",
  },
  {
    title: "Чи можу я відстежувати весь процес пересування авто?",
    description: "Так, ми надаємо всю інформацію для цього.",
  },
  {
    title:
      "Я не хочу биту машину, краще переплатити, але взяти цілу в Польші чи Україні.",
    description:
      "Більшість авто які продаються в Україні на ринку – це колишні биті авто з США. Залишається питання – наскільки добре відремонтоване авто? Часто продавці економлять на деталях та ремонту. Якщо ви купуєте авто із США то економите до 40% від його вартості і можете особисто займатися процесом ремонту - зробити собі надійно і високоякісно.\nНа ринку Польші ситуація трохи інша. Авто із США тільки починають з’являтися на дорогах країни. Вигода від ринку Польші така сама як і в Україні - до 40%, але крім фінвнсової вигоди ви отримаєте: чесний пробіг, історія авто, якісний ремонт.",
  },
];

export const FifthPart = () => {
  const [isOpened, setIsOpened] = useState([]);

  const handleClick = (idx) => {
    if (isOpened.includes(idx)) {
      setIsOpened(isOpened.filter((item) => item !== idx));
    } else {
      setIsOpened([...isOpened, idx]);
    }
  };

  const dropdownMarkup = data.map((item, idx) => (
    <li className={s.listItem} key={idx} onClick={() => handleClick(idx + 1)}>
      <div
        className={s.titleWrapper}
        style={
          isOpened.find((item) => item === idx + 1)
            ? {}
            : { borderRadius: "10px" }
        }
      >
        <Icon
          className={s.icon}
          iconId="dropdownIndicator"
          style={
            isOpened.find((item) => item === idx + 1)
              ? { transform: "rotateX(180deg)" }
              : {}
          }
        />
        <p className={s.title}>{item.title}</p>
      </div>
      <p
        className={s.description}
        style={
          isOpened.find((item) => item === idx + 1)
            ? {}
            : { height: 0, padding: "0 10px", opacity: 0 }
        }
        dangerouslySetInnerHTML={{
          __html: item.description.replace(/\n/g, "<br/>"),
        }}
      ></p>
    </li>
  ));
  return (
    <div className={s.wrapper}>
      <ul className={s.list}>{dropdownMarkup}</ul>
    </div>
  );
};
