export const faqData = [
    {
      title: "У США продається один мотлох, навіщо там купувати машину?",
      description:
        "Ринок США дуже багатий на авто будь-якого класу та стану. Щодня з аукціону продається приблизно 2000 автомобілів різних марок та комплектацій. Там є ті, що не підлягають відновленню, так і ті, що мають незначні пошкодження. \nНаше завдання – знайти для вас найкраще з того, що можна вибрати на страховому аукціоні. Всі варіанти погоджуються з клієнтом.",
    },
    {
      title: "Чи може фактична ціна відрізнятися від розрахункової?",
      description:
        "Різниця кінцевої вартості авто без ремонту не перевищує 100$ від розрахункової.",
    },
    {
      title: "Як довго чекати на авто з США?",
      description:
        "<b>Доставка авто ділиться на кілька етапів:</b><ul><li>Доставка від площадки аукціону на склад в США, в середньому до 7 днів;</li><li>Доставка контейнера в порт 5-14 днів</li><li>Доставка морем, від місяця до 2х;</li><li>Розвантаження та доставка авто з Клайпеди до Львова 7-10 робочих днів;</li><li>Розмитнення авто 1 день.</li></ul>",
    },
    {
      title: "Де робити ремонт машини?",
      description:
        "<b>Ремонт можливий на нашому СТО.</b>\nТакож ми можемо доставити авто клієнту без ремонту на будь яке СТО для самостійного ремонту.",
    },
    {
      title: "Чому з Америки машини дешевші?",
      description:
        "У США дуже розвинена страхова система і дорогий ринок праці. Легка несправність або ДТП автомобіля може коштувати більше вартості цілого аналога, тому в США страховій компанії легше виставити автомобіль на аукціон, ніж ремонтувати його.",
    },
    {
      title: "Які гарантії?",
      description:
        "Можливе підписання із замовником договору про надання послуг. Всі платежі за авто та транспортування ви робите безпосередньо на аукціон або на компанію перевізника.",
    },
    {
      title: "Чи можу я відстежувати весь процес пересування авто?",
      description: "Так, ми надаємо всю інформацію для цього.",
    },
    {
      title:
        "Я не хочу биту машину, краще переплатити, але взяти цілу в Польші чи Україні.",
      description:
        "Більшість авто які продаються в Україні на ринку – це колишні биті авто з США. Залишається питання – наскільки добре відремонтоване авто? Часто продавці економлять на деталях та ремонту. Якщо ви купуєте авто із США то економите до 40% від його вартості і можете особисто займатися процесом ремонту - зробити собі надійно і високоякісно.\nНа ринку Польші ситуація трохи інша. Авто із США тільки починають з’являтися на дорогах країни. Вигода від ринку Польші така сама як і в Україні - до 40%, але крім фінвнсової вигоди ви отримаєте: чесний пробіг, історія авто, якісний ремонт.",
    },
  ];
  
export const carMakes = [
    "Acura",
    "Alfa Romeo",
    "Aston Martin",
    "Audi",
    "Bentley",
    "BMW",
    "Bugatti",
    "Buick",
    "Cadillac",
    "Chevrolet",
    "Chrysler",
    "Daewoo",
    "Dodge",
    "Ferrari",
    "Fiat",
    "Fisker",
    "Ford",
    "Genesis",
    "Geo",
    "GMC",
    "Honda",
    "Hummer",
    "Hyundai",
    "Infititi",
    "Isuzu",
    "Jaguar",
    "Jeep",
    "Kia",
    "Lamborghini",
    "Land Rover",
    "Lexus",
    "Lincoln",
    "Lotus",
    "Lucid",
    "Maserati",
    "Maybach",
    "Mazda",
    "McLaren",
    "Mercedes-Benz",
    "Mercury",
    "MINI",
    "Mitsubishi",
    "Nissan",
    "Oldsmobile",
    "Plymouth",
    "Polestar",
    "Pontiac",
    "Porsche",
    "Ram",
    "Rivian",
    "Rolls-Royce",
    "Saab",
    "Saturn",
    "Scion",
    "Smart",
    "Spyker",
    "Subaru",
    "Suzuki",
    "Tesla",
    "Toyota",
    "Volkswagen",
    "Volvo",
  ];

export const carsExamplesData = [
    {
      img: "https://cdn.riastatic.com/photosnew/auto/photo/Hyundai_Tucson__523144308f.jpg",
      carName: "Hyundai Tucson Sel",
      parameters: {
        fuelType: "Бензин",
        year: "2018",
        drive: "Передній",
        mileage: "40285mi",
        gearbox: "Автомат",
        type: "SUV",
      },
      price: {
        finalBid: "6900$",
        inUkraine: "18130$",
        inPoland: "16500$",
      },
    },
    {
      img: "https://cdn2.riastatic.com/photosnew/auto/photo/audi_q5__410391477f.jpg",
      carName: "Audi Q5",
      parameters: {
        fuelType: "Бензин",
        year: "2016",
        drive: "Передній",
        mileage: "63285mi",
        gearbox: "Автомат",
        type: "SUV",
      },
      price: {
        finalBid: "6900$",
        inUkraine: "18130$",
        inPoland: "16500$",
      },
    },
    {
      img: "https://www.robin-noorda.com/uploads/1/6/8/3/16830688/3347022_orig.jpg",
      carName: "Example",
      parameters: {
        fuelType: "Бензин",
        year: "2016",
        drive: "Передній",
        mileage: "63285mi",
        gearbox: "Автомат",
        type: "SUV",
      },
      price: {
        finalBid: "6900$",
        inUkraine: "18130$",
        inPoland: "16500$",
      },
    },
  ];